zibolux/Mowgli/stm32/ros_usbnode/src/main.c
    //HAL_UART_Receive_IT(&DRIVEMOTORS_USART_Handler, &drivemotors_rcvd_data, 1);    
    HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler, &drivemotors_rcvd_data, 1);
    DB_TRACE(" * Drive Motors UART DMX (TX/TX) enabled\r\n");

    HAL_UART_Receive_IT(&PANEL_USART_Handler, &panel_rcvd_data, 1);   // rearm interrupt               
    DB_TRACE(" * Panel Interrupt enabled\r\n");

    HAL_GPIO_WritePin(LED_GPIO_PORT, LED_PIN, 0);
    HAL_GPIO_WritePin(TF4_GPIO_PORT, TF4_PIN, 1);
    HAL_GPIO_WritePin(PAC5210RESET_GPIO_PORT, PAC5210RESET_PIN, 0);     // take Drive Motor PAC out of reset if LOW

    // send some init messages - needs further investigation, drivemotors are happy without it
    HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, drivemotors_init, 38, HAL_MAX_DELAY);
    HAL_Delay(100);
    HAL_UART_Transmit(&DRIVEMOTORS_USART_Handler, drivemotors_init, 38, HAL_MAX_DELAY);
    HAL_Delay(100);
    DB_TRACE(" * Drive Motors initialized\r\n");
  

    // Initialize Main Timers
	NBT_init(&main_chargecontroller_nbt, 10);
    NBT_init(&main_statusled_nbt, 1000);
	NBT_init(&main_emergency_nbt, 10);
    NBT_init(&main_ultrasonicsensor_nbt, 50);
    NBT_init(&main_blademotor_nbt, 100);

    DB_TRACE(" * NBT Main timers initialized\r\n");     

 #ifdef I_DONT_NEED_MY_FINGERS
    DB_TRACE("\r\n");
    DB_TRACE("=========================================================\r\n");
    DB_TRACE(" EMERGENCY/SAFETY FEATURES ARE DISABLED IN board.h ! \r\n");
    DB_TRACE("=========================================================\r\n");
    DB_TRACE("\r\n");
 #endif
    // Initialize ROS
    init_ROS();
    DB_TRACE(" * ROS serial node initialized\r\n");     
    DB_TRACE("\r\n >>> entering main loop ...\r\n\r\n"); 
    // <chirp><chirp> means we are in the main loop 
    chirp(2);    
    while (1)
    {        
        chatter_handler();
        motors_handler();    
        panel_handler();
        spinOnce();                       
        if (drivemotors_rx_STATUS == RX_VALID)                    // valid frame received from DRIVEMOTORS USART
        {
            uint8_t direction = drivemotors_rx_buf[5];
            // we need to adjust for direction (+/-) !
            if ((direction & 0xc0) == 0xc0)
            {            
                left_direction = 1;
            }
            else if ((direction & 0x80) == 0x80)
            {
                left_direction = -1;
            }
            else
            {
                left_direction = 0;
            }
            if ( (direction & 0x30) == 0x30)
            {            
                right_direction = 1;
            }
            else if ( (direction & 0x20) == 0x20)
            {
                right_direction = -1;
            }
            else
            {
                right_direction = 0;
            }
                        
            left_encoder_val = (drivemotors_rx_buf[14]<<8)+drivemotors_rx_buf[13];
            right_encoder_val = (drivemotors_rx_buf[16]<<8)+drivemotors_rx_buf[15];

            /*
              Encoder value can reset to zero twice when changing direction
              2nd reset occurs when the speed changes from zero to non-zero
            */
            left_wheel_speed_val =  left_direction * drivemotors_rx_buf[6];
            if( left_direction == 0 || (left_direction != prev_left_direction) || (prev_left_wheel_speed_val == 0 && left_wheel_speed_val != 0) )
            {
                prev_left_encoder_val = 0;
            }
            left_encoder_ticks += left_direction * (left_encoder_val - prev_left_encoder_val);
            prev_left_encoder_val = left_encoder_val;
            prev_left_wheel_speed_val = left_wheel_speed_val;
            prev_left_direction = left_direction;

            right_wheel_speed_val =  right_direction * drivemotors_rx_buf[7];
            if( right_direction == 0 || (right_direction != prev_right_direction) || (prev_right_wheel_speed_val == 0 && right_wheel_speed_val != 0) )
            {
                prev_right_encoder_val = 0;
            }
            right_encoder_ticks += right_direction * (right_encoder_val - prev_right_encoder_val);
            prev_right_encoder_val = right_encoder_val;
            prev_right_wheel_speed_val = right_wheel_speed_val;
            prev_right_direction = right_direction;


            //if (drivemotors_rx_buf[5]>>4)       // stuff is moving
           // {
            //  msgPrint(drivemotors_rx_buf, drivemotors_rx_buf_idx);             
           // }                    
            drivemotors_rx_buf_idx = 0;
            drivemotors_rx_STATUS = RX_WAIT;                    // ready for next message                        
            HAL_GPIO_TogglePin(LED_GPIO_PORT, LED_PIN);         // flash LED                         
        }     
    
        broadcast_handler();   
        if (NBT_handler(&main_chargecontroller_nbt))
	    {            
			ChargeController();
	    }
        if (NBT_handler(&main_statusled_nbt))
	    {            
			StatusLEDUpdate();          
                       
            // DB_TRACE("master_rx_STATUS: %d  drivemotors_rx_buf_idx: %d  cnt_usart2_overrun: %x\r\n", master_rx_STATUS, drivemotors_rx_buf_idx, cnt_usart2_overrun);           
	    }
        if (NBT_handler(&main_ultrasonicsensor_nbt))
	    {            
			ULTRASONICSENSOR_App();                   
	    }
        if (NBT_handler(&main_blademotor_nbt))
	    {            
			BLADEMOTOR_App();                   
	    }
        
#ifndef I_DONT_NEED_MY_FINGERS
		if (NBT_handler(&main_emergency_nbt))
		{
			EmergencyController();
		}
#endif        
    }
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    // we never get here ...
    /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}

/**
 * @brief Init the Master Serial Port  - this what connects to the upstream controller
 * @retval None
 */
void MASTER_USART_Init()
{
    // enable port and usart clocks
    MASTER_USART_GPIO_CLK_ENABLE();
    MASTER_USART_USART_CLK_ENABLE();

    GPIO_InitTypeDef GPIO_InitStruct;
    // RX
    GPIO_InitStruct.Pin = MASTER_USART_RX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(MASTER_USART_RX_PORT, &GPIO_InitStruct);

    // TX
    GPIO_InitStruct.Pin = MASTER_USART_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    //GPIO_InitStruct.Pull = GPIO_PULLDOWN;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init(MASTER_USART_TX_PORT, &GPIO_InitStruct);


    MASTER_USART_Handler.Instance = MASTER_USART_INSTANCE;     // USART1 (DEV)
    MASTER_USART_Handler.Init.BaudRate = 115200;               // Baud rate
    MASTER_USART_Handler.Init.WordLength = UART_WORDLENGTH_8B; // The word is  8  Bit format
    MASTER_USART_Handler.Init.StopBits = USART_STOPBITS_1;     // A stop bit
    MASTER_USART_Handler.Init.Parity = UART_PARITY_NONE;       // No parity bit
    MASTER_USART_Handler.Init.HwFlowCtl = UART_HWCONTROL_NONE; // No hardware flow control
    MASTER_USART_Handler.Init.Mode = USART_MODE_TX_RX;         // Transceiver mode

    HAL_UART_Init(&MASTER_USART_Handler); // HAL_UART_Init() Will enable  UART1

