zibolux/Mowgli/stm32/ros_usbnode/src/main.c
}

/**
  * Enable DMA controller clock
  */
void MX_DMA_Init(void)
{

   /* DMA controller clock enable */
  __HAL_RCC_DMA1_CLK_ENABLE();
  __HAL_RCC_DMA2_CLK_ENABLE();

  /* DMA interrupt init */
/* DMA1_Channel1_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
  /* DMA1_Channel2_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
  /* DMA1_Channel3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel3_IRQn);
  /* DMA1_Channel6_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel6_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel6_IRQn);
  /* DMA1_Channel7_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA1_Channel7_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA1_Channel7_IRQn);
  /* DMA2_Channel3_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Channel3_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Channel3_IRQn);
  /* DMA2_Channel4_5_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(DMA2_Channel4_5_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ(DMA2_Channel4_5_IRQn);

}


/*
 * manaes the charge voltage, and charge, lowbat LED
 * improvementt need to be done to avoid sparks when connected charger and disconnected 
 * todo PID current measure
 * needs to be called frequently
 */
void ChargeController(void)
{                        
    static CHARGER_STATE_e charger_state = CHARGER_STATE_IDLE;
    static uint32_t timestamp = 0;
    charge_voltage =  chargerVoltage;                    
    battery_voltage = batteryVoltage;
    charge_current = current - charge_current_offset;

    //DB_TRACE(" Charge Voltage: %2.2fV, Battery Voltage: %2.2fV, Current: %fA \r\n", charge_voltage, battery_voltage,charge_current);

    
    switch (charger_state)
    {
    case CHARGER_STATE_CONNECTED:
        
        /* when connected the 3.3v and 5v is provided by the charger so we get the real biais of the current measure
        * todo poweroff the 24V,   
        */
        chargecontrol_pwm_val = 00;

        /* wait 100ms to read current */
        if( (HAL_GetTick() - timestamp) > 100){
            charge_current_offset = current;
            charger_state = CHARGER_STATE_CHARGING_CC;
        }

        break;

    case CHARGER_STATE_CHARGING_CC:
        // cap charge current at 1 Amps
        if ((charge_current > MAX_CHARGE_CURRENT) && (chargecontrol_pwm_val > 50))
        {
            chargecontrol_pwm_val--;
        }
        if ((charge_current < MAX_CHARGE_CURRENT) && (chargecontrol_pwm_val < 1350))
        {
            chargecontrol_pwm_val++;
        }

        if(charge_voltage >= 29.4){
            charger_state = CHARGER_STATE_CHARGING_CV;
        }
        /*charger disconnected */
        if(charge_voltage <= 0.2){
            charger_state = CHARGER_STATE_IDLE;
        }

        break;

    case CHARGER_STATE_CHARGING_CV:
        // set PWM to approach 29.4V charge voltage
        if ((charge_voltage < 29.4) && (chargecontrol_pwm_val < 1350))
        {
            chargecontrol_pwm_val++;
        }            
        if ((charge_voltage > 29.4) && (chargecontrol_pwm_val > 50))
        {
            chargecontrol_pwm_val--;
        }

        /* battery full ? */
        if (charge_current < CHARGE_END_LIMIT_CURRENT) {
             charger_state = CHARGER_STATE_IDLE;
        }
        
        /*charger disconnected */
        if(charge_voltage <= 0.2){
            charger_state = CHARGER_STATE_IDLE;
        }
        break;

    case CHARGER_STATE_END_CHARGING:
        chargecontrol_pwm_val = 0;
        break;


    case CHARGER_STATE_IDLE:
    default:
       

        if (charge_voltage >= MIN_CHARGE_VOLTAGE ) {
            charger_state = CHARGER_STATE_CONNECTED;
            timestamp = HAL_GetTick();
        }
        chargecontrol_pwm_val = MIN_CHARGE_PWM;
        break;
    }
    
    chargecontrol_is_charging = charger_state;

    /*Check the PWM value for safety */
    if (chargecontrol_pwm_val > 1350){
        chargecontrol_pwm_val = 1350;
    }
    TIM1->CCR1 = chargecontrol_pwm_val;  
    
}

/*
 * Update the states for the Emergency, Charge and Low Bat LEDs
 */
void StatusLEDUpdate(void)
{
        if (Emergency_State()) {
            DB_TRACE("Emergency !");
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_FLASH_FAST);
        } else {
            PANEL_Set_LED(PANEL_LED_LIFTED, PANEL_LED_OFF);
        }

        if (chargecontrol_is_charging == 1) //Connected to charger
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_ON);
        }
        else if (chargecontrol_is_charging == 2) //CC mode 1A
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_FLASH_FAST);
        }
        else if(chargecontrol_is_charging == 2) //CV mode
        {
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_FLASH_SLOW);
        }
        else{
            PANEL_Set_LED(PANEL_LED_CHARGING, PANEL_LED_OFF);
        }

        // show a lowbat warning if battery voltage drops below LOW_BAT_THRESHOLD ? (random guess, needs more testing or a compare to the stock firmware)                   
        if (battery_voltage <= LOW_CRI_THRESHOLD)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_FAST); // low
        }
        else if (battery_voltage <= LOW_BAT_THRESHOLD)
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_FLASH_SLOW); // really low
        }
        else
        {
            PANEL_Set_LED(PANEL_LED_BATTERY_LOW, PANEL_LED_OFF); // bat ok
        }                                           
}

/*
 * Send message to DriveMotors PAC
 *
 * <xxx>_speed = 0x - 0xFF
 * <xxx>_dir = 1 = CW, 1 != CCW
 */
void setDriveMotors(uint8_t left_speed, uint8_t right_speed, uint8_t left_dir, uint8_t right_dir)
{
    uint8_t direction = 0x0;            
    static uint8_t drivemotors_msg[DRIVEMOTORS_MSG_LEN] =  { 0x55, 0xaa, 0x8, 0x10, 0x80, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0};
    
    drivemotors_msg[5] = direction;
    drivemotors_msg[6] = left_speed;
    drivemotors_msg[7] = right_speed;

